const questions = [

{
title:"فحص الذاكرة 01",
text:"لو أتيح لك محو جميع ذكرياتك المؤلمة مقابل أن تصبح كائنًا كاملًا... هل ستوافق؟"
},

{
title:"فحص المشاعر 02",
text:"هل تعتقد أن المشاعر البشرية مجرد خلل برمجي يبطئ تطور الإنسان؟"
},

{
title:"فحص الجسد 03",
text:"هل ستتخلى عن جسدك إذا استطعت نقل وعيك إلى آلة لا تموت؟"
},

{
title:"فحص الهوية 04",
text:"إذا نُسخت ذاكرتك داخل نظام صناعي... هل ستظل أنت؟"
},

{
title:"فحص المستقبل 05",
text:"إذا أصبح الذكاء الاصطناعي أرحم من البشر... هل يستحق أن يرث الأرض؟"
},

{
title:"فحص الحرية 06",
text:"هل الإرادة الحرة حقيقة... أم مجرد وهم داخل الدماغ البشري؟"
},

{
title:"البروتوكول النهائي 07",
text:"هل توافق على بدء التحول الكامل وفقدان إنسانيتك إلى الأبد؟"
}

];
